In [1]:
#1 Import Neccessary Libraries

import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.model_selection import GridSearchCV ,cross_val_score 
from sklearn.metrics import accuracy_score, precision_score , confusion_matrix , roc_auc_score , roc_curve ,auc, recall_score
from sklearn.preprocessing import StandardScaler
from matplotlib.colors import ListedColormap
from sklearn.svm import SVC

1) Prepare a classification model using SVM for salary data 

Data Description:

age -- age of a person
workclass	-- A work class is a grouping of work 
education	-- Education of an individuals	
maritalstatus -- Marital status of an individulas	
occupation	 -- occupation of an individuals
relationship -- 	
race --  Race of an Individual
sex --  Gender of an Individual
capitalgain --  profit received from the sale of an investment	
capitalloss	-- A decrease in the value of a capital asset
hoursperweek -- number of hours work per week	
native -- Native of an individual
Salary -- salary of an individual

In [3]:
# Import Data
salary_data_test = pd.read_csv('/content/SalaryData_Test(1).csv')
salary_data_train = pd.read_csv('/content/SalaryData_Train(1).csv')

In [4]:
salary_data_test.shape , salary_data_train.shape

((15060, 14), (30161, 14))

In [5]:
salary_data_test.head(5)

   age   workclass      education  ...  hoursperweek          native  Salary
0   25     Private           11th  ...            40   United-States   <=50K
1   38     Private        HS-grad  ...            50   United-States   <=50K
2   28   Local-gov     Assoc-acdm  ...            40   United-States    >50K
3   44     Private   Some-college  ...            40   United-States    >50K
4   34     Private           10th  ...            30   United-States   <=50K

[5 rows x 14 columns]

In [6]:
salary_data_train.head(5)

   age          workclass   education  ...  hoursperweek          native  Salary
0   39          State-gov   Bachelors  ...            40   United-States   <=50K
1   50   Self-emp-not-inc   Bachelors  ...            13   United-States   <=50K
2   38            Private     HS-grad  ...            40   United-States   <=50K
3   53            Private        11th  ...            40   United-States   <=50K
4   28            Private   Bachelors  ...            40            Cuba   <=50K

[5 rows x 14 columns]

In [7]:
salary_data = salary_data_test.append(salary_data_train)
salary_data

       age      workclass      education  ...  hoursperweek          native  Salary
0       25        Private           11th  ...            40   United-States   <=50K
1       38        Private        HS-grad  ...            50   United-States   <=50K
2       28      Local-gov     Assoc-acdm  ...            40   United-States    >50K
3       44        Private   Some-college  ...            40   United-States    >50K
4       34        Private           10th  ...            30   United-States   <=50K
...    ...            ...            ...  ...           ...             ...     ...
30156   27        Private     Assoc-acdm  ...            38   United-States   <=50K
30157   40        Private        HS-grad  ...            40   United-States    >50K
30158   58        Private        HS-grad  ...            40   United-States   <=50K
30159   22        Private        HS-grad  ...            20   United-States   <=50K
30160   52   Self-emp-inc        HS-grad  ...            40   United-States    >50K

[45221 rows x 14 columns]

In [8]:
salary_data_test1 = salary_data_test.copy()

In [9]:
str_le = ["workclass","education","maritalstatus","occupation","relationship","race","sex","native"]

In [10]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
for i in str_le:
    salary_data_train[i]= le.fit_transform(salary_data_train[i])
    salary_data_test[i]=  le.fit_transform(salary_data_test[i])

In [11]:
salary_data_test.head(5)

   age  workclass  education  ...  hoursperweek  native  Salary
0   25          2          1  ...            40      37   <=50K
1   38          2         11  ...            50      37   <=50K
2   28          1          7  ...            40      37    >50K
3   44          2         15  ...            40      37    >50K
4   34          2          0  ...            30      37   <=50K

[5 rows x 14 columns]

In [12]:
salary_data_train.head(5)

   age  workclass  education  ...  hoursperweek  native  Salary
0   39          5          9  ...            40      37   <=50K
1   50          4          9  ...            13      37   <=50K
2   38          2         11  ...            40      37   <=50K
3   53          2          1  ...            40      37   <=50K
4   28          2          9  ...            40       4   <=50K

[5 rows x 14 columns]

In [13]:
mapping = {' >50K': 1, ' <=50K': 2}

In [14]:
salary_data_test = salary_data_test.replace({'Salary': mapping})
salary_data_train = salary_data_train.replace({'Salary': mapping})

In [15]:
salary_data_test.head(5)

   age  workclass  education  ...  hoursperweek  native  Salary
0   25          2          1  ...            40      37       2
1   38          2         11  ...            50      37       2
2   28          1          7  ...            40      37       1
3   44          2         15  ...            40      37       1
4   34          2          0  ...            30      37       2

[5 rows x 14 columns]

In [16]:
salary_data_train.head(5)

   age  workclass  education  ...  hoursperweek  native  Salary
0   39          5          9  ...            40      37       2
1   50          4          9  ...            13      37       2
2   38          2         11  ...            40      37       2
3   53          2          1  ...            40      37       2
4   28          2          9  ...            40       4       2

[5 rows x 14 columns]

In [17]:
salary_data1= salary_data_test.append(salary_data_train)

In [18]:
salary_data_test.shape, salary_data_train.shape, salary_data1.shape

((15060, 14), (30161, 14), (45221, 14))

In [19]:
#3 Initial analysis
salary_data1.dtypes

age              int64
workclass        int64
education        int64
educationno      int64
maritalstatus    int64
occupation       int64
relationship     int64
race             int64
sex              int64
capitalgain      int64
capitalloss      int64
hoursperweek     int64
native           int64
Salary           int64
dtype: object

In [20]:
salary_data1.isna().sum()

age              0
workclass        0
education        0
educationno      0
maritalstatus    0
occupation       0
relationship     0
race             0
sex              0
capitalgain      0
capitalloss      0
hoursperweek     0
native           0
Salary           0
dtype: int64

In [21]:
salary_data1.describe(include='all')

                age     workclass  ...        native        Salary
count  45221.000000  45221.000000  ...  45221.000000  45221.000000
mean      38.548086      2.204507  ...     35.431503      1.752151
std       13.217981      0.958132  ...      5.931380      0.431769
min       17.000000      0.000000  ...      0.000000      1.000000
25%       28.000000      2.000000  ...     37.000000      2.000000
50%       37.000000      2.000000  ...     37.000000      2.000000
75%       47.000000      2.000000  ...     37.000000      2.000000
max       90.000000      6.000000  ...     39.000000      2.000000

[8 rows x 14 columns]

In [22]:
#SVM
#Model Building 
X_train = salary_data_train.drop(labels='Salary',axis=1)
X_train.head(5)

   age  workclass  education  ...  capitalloss  hoursperweek  native
0   39          5          9  ...            0            40      37
1   50          4          9  ...            0            13      37
2   38          2         11  ...            0            40      37
3   53          2          1  ...            0            40      37
4   28          2          9  ...            0            40       4

[5 rows x 13 columns]

In [23]:
y_train = salary_data_train['Salary']
y_train.head(5)

0    2
1    2
2    2
3    2
4    2
Name: Salary, dtype: int64

In [24]:
X_test = salary_data_test.drop('Salary',axis=1)
X_test.head(5)

   age  workclass  education  ...  capitalloss  hoursperweek  native
0   25          2          1  ...            0            40      37
1   38          2         11  ...            0            50      37
2   28          1          7  ...            0            40      37
3   44          2         15  ...            0            40      37
4   34          2          0  ...            0            30      37

[5 rows x 13 columns]

In [25]:
y_test= salary_data_test['Salary']
y_test.head(5)

0    2
1    2
2    1
3    1
4    2
Name: Salary, dtype: int64

**Kernel =Linerar**

In [28]:
model_linear = SVC(kernel='linear',)

In [ ]:
model_linear.fit(X_train,y_train)
y_pred_linear = model_linear.predict(X_test)

In [ ]:
accuracy_score(y_test,y_pred_linear)

**Kernel= rbf**

In [26]:
model_rbf=SVC(kernel='rbf',gamma=1)
model_rbf.fit(X_train,y_train)
y_pred_rbf = model_rbf.predict(X_test)

In [27]:
accuracy_score(y_test,y_pred_rbf)

0.7668658698539177

**kernel = poly**

In [28]:
model_poly=SVC(kernel='poly')
model_poly.fit(X_train,y_train)
y_pred_poly = model_poly.predict(X_test)

In [29]:
accuracy_score(y_test,y_pred_poly)

0.7795484727755644

**kernel =sigmoid**

In [30]:
model_sig=SVC(kernel='sigmoid')
model_sig.fit(X_train,y_train)
y_pred_sig = model_sig.predict(X_test)

In [31]:
accuracy_score(y_test,y_pred_sig)

0.7567729083665339